src/DataProcessors/ДанныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ДанныеФормы</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТабЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ДанныеФормы/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для А=1 По 5000 Цикл
		НовСтр = Объект.ТабЧасть.Добавить();
		НовСтр.Объект = "Объект "+А;
		НовСтр.Показатель = 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНаКлиенте(Команда)
	
	Для каждого Стр Из Объект.ТабЧасть Цикл
		Стр.Показатель = Стр.Показатель+1		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаНаСервере(Команда)
	
	ОбработкаНаСервереНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаНаСервереНаСервере()
	
	Для каждого Стр Из Объект.ТабЧасть Цикл
		Стр.Показатель = Стр.Показатель+1		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстныйВызов(Команда)
	КонтекстныйВызовНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтекстныйВызовНаСервере()
	
	НовСтр = Объект.ТабЧасть.Добавить();
	НовСтр.Объект = "Дополнительный";
	НовСтр.Показатель = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередачаЧерезПараметр(Команда)
	ПередачаЧерезПараметрНаСервере(Объект.ТабЧасть);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПередачаЧерезПараметрНаСервере(Знач ТабЧасть)

		
КонецПроцедуры
